/*



const store = {
    _state: {
        pizza: {
            id1: [{
                name: "1/2 Вегетарианская 43 см+1/2 Куриная 43 см",
                const: "24.90 руб.",
                description: "Соус, сыр, болгарский перец, томаты, шампиньоны св., лук, маслины"
            }],
            id2: [{
                name: "1/2 Гавайская 43 см+1/2 ",
                const: "32.90 руб.",
                description: "Соус, курица, ветчина, ананас, кукуруза, сыр моцарелла, стружка кокоса"
            }],
            id3: [{
                name: "1/2 Супермясная 43 см+1/2",
                const: "40.90 руб.",
                description: "Соус, салями, охотничьи колбаски, ветчина, бекон, черри, лук красный, сыр моцарелла, горчичный BBQ"
            }],
            id4: [{
                name: "1/2 Грибной квартет 43 см+1/2",
                const: "45.90 руб.",
                description: "Соус,сыр моцарелла, лук, грибы: белый гриб, вешенки"
            }],
            id5: [{
                name: "1/2 Флоренция 43 см+1/2",
                const: "50.90 руб.",
                description: "Соус,копчёная куриная грудка, чили, сыр моцарелла, соус манго-халапеньо, кунжут"
            }],
            id6: [{
                name: "1/2 Порто 43 см+1/2",
                const: "60.90 руб.",
                description: "Соус,филе цыплёнка, кукуруза, вишня, сыр моцарелла, соус порто"
            }],
            id7: [{
                name: "1/2 Маргарита 43 см+1/2",
                const: "63.90 руб.",
                description: "Соус,черри, сыр моцарелла, сыр пармезан, шпинат"
            }],
            id8: [{
                name: "1/2 Утка Терияки 43 см+1/2",
                const: "63.90 руб.",
                description: "Соус, утиная грудка, ананасы, соус терияки, сыр моцарелла, кунжут"
            }],
            id9: [{
                name: "1/2 Норвежская 43 см+1/2",
                const: "73.90 руб.",
                description: "Соус, слабосолёный лосось, сыр филадельфия, сыр моцарелла, руккола"
            }],
            id10: [{
                name: "1/2 Верона 43 см+1/2",
                const: "75.90 руб.",
                description: "Соус, ветчина, шампиньоны, болгарский перец, шпинат, сыр моцарелла"
            }],
            id11: [{
                name: "1/2 Том-Ям 43 см+1/2",
                const: "125.90 руб.",
                description: "Соус, тигровые креветки, куриное филе, шампиньоны, помидоры, чили, сыр моцарелла, кунжут"
            }],
            id12: [{
                name: "1/2 Эмилия 43 см+1/2",
                const: "90.90 руб.",
                description: "Соус, мусс из шпината, сыр филадельфия, сыр моцарелла, шпинат"
            }]
        },
        sets: {
            id1: [{
                name: "В офис",
                price: "35.90 руб.",
                description: "Пиццы: Сырные палочки (на тесте) с беконом, Тематическая 31 см, Конфетная 31 см"
            }],
            id2: [{
                name: "Две пиццы « По-швейцарски 43 см»",
                price: "28.00 руб.",
                description: "соус, сыр, сервелат, шампиньоны"
            }],
            id3: [{
                name: "Для большой компании",
                price: "59.90 руб.",
                description: "Пиццы:сырные палочки (на тесте) с беконом,Цыплёнок Карри 43,Тематическая 43,По-Швейцарски 43"
            }],
            id4: [{
                name: "На двоих",
                price: "19.90 руб.",
                description: "Пиццы:Цыплёнок карри 23 см,Тематическая 23 см"
            }],
            id5: [{
                name: "Под футбол",
                price: "35.90 руб.",
                description: "Пиццы: Сырная 31см,Бекон с грибами 31см,Мясо и перчик 31см"
            }],
            id6: [{
                name: "Семейка ( Покупайте пиццу Гоу-Гоу 43 см+ Кока-кола 0,5 л и получите подушечки с сах.пудрой и корицей в подарок",
                price: "27.10 руб.",
                description: "27.10 руб."
            }],
            id7: [{
                name: "Супер хит",
                price: "48.90 руб.",
                description: "Пиццы: Мега мясо 43,Гоу-гоу 43,Цыплёнок Карри 23"
            }],
            id8: [{
                name: "Тематическая 43см + Кока-кола 0,5л =сладкие подушечки с корицей и сах.пудрой в подарок",
                price: "26.10 руб.",
                description: "Соус, сыр, пепперони, куриная грудка, лук, соус барбекю"
            }],
            id9: [{
                name: "Трио (По-Швейцарски 43 см,Мега Мясо 31 см,Чики-Чики 23 см)",
                price: "34.60 руб.",
                description: "34.60 руб."
            }],
            id10: [{
                name: "Хитовая десятка (комбо из 10 пицц 31 см)",
                price: "117.90 руб.",
                description: "По-Швейцарски, Гоу-Гоу,Бекон с грибами,Конфетная,Чики-Чики,Цыплёнок Карри,Барбекю,Мега Мясо,Чесночная с курицей,Мясо и перчик"
            }],

        },
        pancakes: {
            id1: [{
                name: "Блин итальянский",
                price: "5.20 руб.",
                description: "Соус,сыр,салями,томаты свежие"
            }],
            id2: [{
                name: "Блин Микс",
                price: "6.90 руб.",
                description: "Соус,сыр,ветчина,бекон,сервелат,огурцы маринованные"
            }],
            id3: [{
                name: "Блин охотничий",
                price: "5.50 руб.",
                description: "Соус,сыр,охотничьи колбаски,огурцы маринованные"
            }],
            id4: [{
                name: "Блин по-деревенски",
                price: "5.50 руб.",
                description: "Соус,сыр,бекон,огурцы маринованные"
            }],
            id5: [{
                name: "Блин с ветчиной",
                price: "6.50 руб.",
                description: "Соус,сыр,ветчина,огурцы маринованные"
            }],
            id6: [{
                name: "Блин с курицей",
                price: "5.60 руб.",
                description: "Соус,сыр,куриная грудка,огурцы маринованные"
            }],
            id7: [{
                name: "Блин сырный",
                price: "4.30 руб.",
                description: "Соус,сыр"
            }],
            id8: [{
                name: "Блинчик с вареньем",
                price: "3.50 руб.",
                description: "3.50 руб."
            }],
            id9: [{
                name: "Блинчик со сгущенкой",
                price: "3.00 руб.",
                description: "3.00 руб."
            }]
        },
        snacks: {
            id1: [{
                name: "Вега Ролл",
                price: "4.50 руб.",
                description: "Соус Ранч ,сыр,томаты свежие,тортилья,маслины,огурцы маринованные"
            }],
            id2: [{
                name: "Картофельные дольки 150гр",
                price: "3.50 руб.",
                description: "3.50 руб."
            }],
            id3: [{
                name: "Картофельные дольки 300гр",
                price: "5.00 руб.",
                description: "5.00 руб."
            }],
            id4: [{
                name: "Наггетсы 160гр",
                price: "5.90 руб.",
                description: "5.90 руб."
            }],
            id5: [{
                name: "Наггетсы 300грр",
                price: "9.90 руб.",
                description: "9.90 руб."
            }],
            id6: [{
                name: "Подушечки ароматные с чесноком",
                price: "3.50 руб.",
                description: "3.50 руб."
            }],
            id7: [{
                name: "Подушечки ароматные с чесноком",
                price: "15.90 руб.",
                description: "Соус,сыр,мясо креветки"
            }],
            id8: [{
                name: "Сырные палочки с беконом",
                price: "15.90 руб.",
                description: "Соус,сыр,мясо, бекон"
            }],
            id9: [{
                name: "Сырные палочки с ветчиной",
                price: "15.90 руб.",
                description: "Соус,сыр,ветчина"
            }],
            id10: [{
                name: "Сырные палочки с креветками",
                price: "23.90 руб.",
                description: "Соус,сыр,мясо креветки"
            }],
            id11: [{
                name: "Сырные палочки с чесноком",
                price: "11.90 руб.",
                description: "Соус,сыр,чеснок"
            }],
        },
        desserts: {
            id1: [{
                name: "Маффин Ванила с начинкой абрикос",
                price: "2.00 руб.",
                description: "Маффин Ванила С начинкой абрикос"
            }],
            id2: [{
                name: "Маффин Чоко с начинкой лимон",
                price: "2.00 руб.",
                description: "Маффин Чоко с начинкой лимон"
            }],
            id3: [{
                name: "Маффин Чоко с начинкой лимон",
                price: "2.00 руб.",
                description: "Маффин Чоко с начинкой лимон"
            }],
            id4: [{
                name: "Пирожное Брауни",
                price: "2.00 руб.",
                description: "Пирожное Брауни"
            }],
            id5: [{
                name: "Пирожное Брауни",
                price: "2.00 руб.",
                description: "Пирожное Брауни"
            }],
            id6: [{
                name: "Пирожное Крамбл с чёрной смородиной",
                price: "3.00 руб.",
                description: "Пирожное Крамбл с чёрной смородиной"
            }],
            id7: [{
                name: "Пирожное Крамбл с чёрной смородиной",
                price: "3.00 руб.",
                description: "Пирожное Крамбл с чёрной смородиной"
            }],
            id8: [{
                name: "Подушечки сладкие с корицей и сахарной пудрой",
                price: "3.50 руб.",
                description: "3.50 руб."
            }],
            sauces: {
                id1: [{
                    name: "Соус грибной",
                    price: "3.20 руб.",
                    description: "В наличии"
                }],
                id2: [{
                    name: "Соус Ранч",
                    price: "1.20 руб.",
                    description: "В наличии"
                }],
                id3: [{
                    name: "Соус сырный",
                    price: "3.20 руб.",
                    description: "В наличии"
                }],
                id4: [{
                    name: "Соусы Камако в ассортименте (20гр)",
                    price: "0.70 руб.",
                    description: "Китайский сладкий,Кунжутно-ореховый,Горчичный,Барбек"
                }],
            },
            drinks: {
                id1: [{
                    name: "Бонаква 0,5 Л",
                    price: "1.80 руб.",
                    description: "Китайский сладкий,Кунжутно-ореховый,Горчичный,Барбек"
                }],
                id2: [{
                    name: "Кока –кола 0,5 Л",
                    price: "2.20 руб.",
                    description: "2.20 руб."
                }],
                id3: [{
                    name: "Напиток сокосодержащий Добрый Палпи",
                    price: "2.50 руб.",
                    description: "2.50 руб."
                }],
                id4: [{
                    name: "Соки (в ассортименте) 0.2 л",
                    price: "1.20 руб.",
                    description: "1.20 руб."
                }],
                id5: [{
                    name: "Соки (в ассортименте) 1л",
                    price: "3.00 руб.",
                    description: "3.00 руб."
                }],
                id6: [{
                    name: "Спрайт 0,5 Л",
                    price: "2.20 руб.",
                    description: "Охлажденный напиток"
                }],
                id7: [{
                    name: "Фанта 0,5 Л",
                    price: "2.20 руб.",
                    description: "Охлажденный напиток"
                }],
                id8: [{
                    name: "Фьюз Ти (холодный чай)",
                    price: "2.50 руб.",
                    description: "2.50 руб."
                }],
                id9: [{
                    name: "Энергетический напиток",
                    price: "2.00 руб.",
                    description: "2.00 руб."
                }]
            }
        },

        _rerenderEntireTree(){
            console.log('State changet')
        },
        subscribe(observer){
            this._rerenderEntireTree = observer;
        }
    },
    getState(){
        return this._state
    }
}
window.store = store;
export default store*/
